# Переменная - объект с каким-либо именем, который что-то в себе хранит
# a = 100
# b = 23
# print(a + b)
# c = "Hello"
# print(c)

# name = "Daniil"
# print("Hello", name)

# функция input() - требует ввода от пользователя.
# name = input("Введите ваше имя: ")
# print("Вы ввели:", name)

# программа, которая будет находить сумму чисел
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# print("Cумма =", a + b)

# Математические операторы
# a = 24
# b = 7
#
# print(a, "+", b, "=", a + b) # + - оператор сложения
# print(a, "-", b, "=", a - b) # - - оператор вычитания
# print(a, "*", b, "=", a * b) # * - оператор умножения
# print(a, "/", b, "=", a / b) # / - оператор деления
#
# print(a, "**", b, "=", a ** b) # ** - оператор возведения в степень
# print(a, "//", b, "=", a // b) # // - оператор деления на цело
# print(a, "%", b, "=", a % b) # % - остаток от деления


# Задача: Пользователь вводит свой год рождения, программа должна вывести
# сколько ему сейчас лет.

# year = int(input("Год рождения: "))
# age = 2025 - year
# print(age)


# Пользователь вводит количество денег и вводит цену одной ручки. программа
# должна выводить сколько ручек сможет купить пользователь

# условия
# print(5 > 1);print("Hello")
# print(5 > 10)


